[
    {
        "id": 1,
        "title": "Connecting to your server's FTP via SSH (in windows)",
        "subtitle": "A guide to enable SSH and connect to remote server via SSH protocol",
        "content": " SSH is typically used to log into a remote machine and execute commands providing a strong authentication and secure encrypted data communications between two computers connecting over an insecure network such as the Internet.<br> I got to work with SSH for the first time in 2015 when me and my project mate were implementing a PHP based website.We were hosting this website on a server in <a href='https://www.openshift.com/' target='_new'>OpenShift</a> platform and since we used Ubuntu, pushing the files from our localhost to server's FTP with <a     href='http://www.linuxandubuntu.com/home/terminator-a-linux-terminal-emulator-with-multiple-terminals-in-one-window'     target='_new'>Terminator</a> was real quick.<br>I had got a similar chance a couple of days back when I had to install <code>node.js</code> on one of my cPanel hostings to host an <code>express.js</code> based API. The hosting and domain were both registered with third party (GoDaddy) and so I get very limited access to core developement tools like server's shell/bash etc. So this lead to the necessity of having a SSH based access to my server which could allow me to install all the <code>npm</code> based packages and let me expose my <i>express.js</i> based API on one of the ports. <br> <br>This is done in the following way: <ol>     <li> Find for the &quot;Security&quot; section on your cPanel dashboard and click on &quot;SSH Access&quot; utility.     </li>     <li>You will see a popup thats prompts you to confirm that you want to Enable SSH for your website.<br> <footer class='blockquote-footer'>     This is more of a warning given by the cPanel to remind     you that enabling SSH allows you (or someone else) to access your server from     anywhere across the internet. </footer>     </li>     <li> Once you click on the <a class='btn btn-success btn-shadow px-2 my-2 ml-0 text-left'>Enable</a> &nbsp;button, your server is now open to be accessed through SSH.     </li> </ol> <div class='lead mb-3 text-mono text-success'>     Connecting the server once SSH access is enabled : </div> Since Windows-based Operating Systems do not come with an SSH client by default, <a href='https://www.putty.org/' target='_new'>PuTTY</a> is one of most used applications for serving the purpose. Follow the below steps to connect to your server with PuTTY: <ol><li>In the &quot;Host Name (or IP address)&quot; field, enter your username for the cPanel login suffixed with domain name. <br>      <div class='text-grey text-spacey'>For e.g. if the username is <u>johnDoe2018</u> and domain name is <u>example.in</u> then the Host Name is <u>johnDoe2018@example.in</u>.</div> </li> <li>     Enter the Port as &quot;22&quot; and select the Connection Type as SSH in the PuTTY app. </li> <li>     Click on open button at the bottom of the PuTTY window. </li> <li>     Enter the password (same as what was entered while logging in to the cPanel) and hit Enter key. <br>     Wait for few seconds until your server's directories appear on the console. </li>     </ol> Thats it! We are now connected to the server via SSH.<br> Any package install that was locally done through <code>npm</code>, <code>sudo</code>, <code>yum</code> etc. can now be done on the server using this session.",
        "publishedOn": "September 4, 2018"
    }
]